import random


anime_questions = [

    {
    "question": "من هو بطل أنمي ناروتو؟",
    "answers": ["ناروتو"]
    },
    {
    "question": "ما اسم قرية ناروتو؟",
    "answers": ["كونوها", "قرية الورق"]
    },
    {
    "question": "من هو والد ناروتو؟",
    "answers": ["ميناتو", "ميناتو ناميكازي"]
    },
    {
    "question": "من هي والدة ناروتو؟",
    "answers": ["كوشينا", "كوشينا اوزوماكي"]
    },
    {
    "question": "من هو معلم الفريق السابع؟",
    "answers": ["كاكاشي", "كاكاشي هاتاكي"]
    },
    {
    "question": "من هو منافس ناروتو؟",
    "answers": ["ساسكي", "ساسكي اوتشيها"]
    },
    {
    "question": "من هي زميلة ناروتو في الفريق السابع؟",
    "answers": ["ساكورا", "ساكورا هارونو"]
    },
    {
    "question": "ما اسم الوحش المختوم داخل ناروتو؟",
    "answers": ["الكيوبي", "كيوبي", "كوراما"]
    },
    {
    "question": "كم عدد الذيول التي يمتلكها كوراما؟",
    "answers": ["9", "٩"]
    },
    {
    "question": "من هو الهوكاجي الرابع؟",
    "answers": ["ميناتو", "ميناتو ناميكازي"]
    },
    {
    "question": "من هو بطل ون بيس؟",
    "answers": ["لوفي", "مونكي دي لوفي"]
    },
    {
    "question": "ما اسم قبعة لوفي؟",
    "answers": ["قبعة القش"]
    },
    {
    "question": "من هو سياف طاقم قبعة القش؟",
    "answers": ["زورو", "رورونوا زورو"]
    },
    {
    "question": "من هو الطباخ في الطاقم؟",
    "answers": ["سانجي"]
    },
    {
    "question": "من هي الملاحة في طاقم لوفي؟",
    "answers": ["نامي"]
    },
    {
    "question": "من هو الطبيب  في طاقم لوفي؟",
    "answers": ["تشوبر", "توني توني تشوبر"]
    },
    {
    "question": "من هو القناص في طاقم لوفي؟",
    "answers": ["اوسوب", "يوسوب"]
    },
    {
    "question": "من هي عالمة الآثار في طاقم لوفي؟",
    "answers": ["نيكو روبين", "روبين"]
    },
    {
    "question": "من هو الموسيقي في طاقم لوفي؟",
    "answers": ["بروك"]
    },
    {
    "question": "من هو قائد الثوار؟",
    "answers": ["دراغون", "مونكي دي دراغون"]
    },
    {
    "question": "من هو ملك القراصنة السابق؟",
    "answers": ["غول دي روجر", "روجر"]
    },
    {
    "question": "من هو نائب ملك القراصنة؟",
    "answers": ["رايلي", "سيلفرز رايلي"]
    },
    {
    "question": "من هو أقوى سياف في العالم؟",
    "answers": ["ميهوك", "دراكيول ميهوك"]
    },
    {
    "question": "من هو قائد قراصنة اللحية البيضاء؟",
    "answers": ["اللحية البيضاء", "ادوارد نيوغيت"]
    },
    {
    "question": "من قتل ايس؟",
    "answers": ["اكاينو", "ساكازوكي"]
    },
    {
    "question": "من هو بطل ديمون سلاير؟",
    "answers": ["تانجيرو", "تانجيرو كامادو"]
    },
    {
    "question": "من هي أخت تانجيرو؟",
    "answers": ["نيزوكو"]
    },
    {
    "question": "من هو أقوى هاشيرا حسب أغلب الأحداث؟",
    "answers": ["غيومي", "غيومي هيميجيما"]
    },
    {
    "question": "من هوالشياطين الرئيسي في جوجوتسو كايسن؟",
    "answers": ["موزان", "موزان كيبوتسوجي"]
    },
    {
    "question": "من هو بطل جوجوتسو كايسن؟",
    "answers": ["ايتادوري", "يوجي", "يوجي ايتادوري"]
    },
    
    {
    "question": "من هو ملك اللعنات؟",
    "answers": ["سكونا", "ريومن سكونا"]
    },
    {
    "question": "من هو صديق يوجي المقرب؟",
    "answers": ["ميغومي", "فوشيغورو"]
    },
    
    {
    "question": "من هو بطل هنتر × هنتر؟",
    "answers": ["غون", "غون فريكس"]
    },
    {
    "question": "من هو أفضل صديق لغون؟",
    "answers": ["كيلوا", "كيلوا زولديك"]
    },
    {
    "question": "من هو زعيم العناكب؟",
    "answers": ["كرولو", "كرولو لوسيلفر"]
    },
    {
    "question": "من يستخدم سلاسل النين؟",
    "answers": ["كورابيكا"]
    },
    {
    "question": "من هو والد غون؟",
    "answers": ["جين", "جين فريكس"]
    },
    {
    "question": "من هو بطل ديث نوت؟",
    "answers": ["لايت", "لايت ياغامي"]
    },
    {
    "question": "ما اسم الشينيغامي الذي أعطى لايت الدفتر؟",
    "answers": ["ريوك"]
    },
    {
    "question": "من هو المحقق الشهير في ديث نوت؟",
    "answers": ["ال", "L"]
    },
    {
    "question": "من هو بطل هجوم العمالقة؟",
    "answers": ["ايرين", "ايرين ييغر"]
    },
    {
    "question": "من هي أخت إيرين بالتبني؟",
    "answers": ["ميكاسا"]
    },
    {
    "question": "من هو صديق إيرين؟",
    "answers": ["ارمين"]
    },
    {
    "question": "من هو بطل دراغون بول؟",
    "answers": ["غوكو", "سون غوكو"]
    },
    {
    "question": "من هو أمير الساياجين؟",
    "answers": ["فيجيتا"]
    },
    {
    "question": "من هو أقوى أندرويد في دراغون بول سوبر؟",
    "answers": ["17", "اندرويد 17"]
    },
       
    {
        "question": "من هو قائد منظمة الأكاتسوكي؟",
        "answers": ["باين", "ناغاتو"]
    },
        
    {
        "question": "من هو أقوى مشعوذ في جوجوتسو كايسن؟",
        "answers": ["غوجو"]
    },

    {
        "question": "من هو بطل انمي قاتل الشياطين؟",
        "answers": ["تانجيرو"]
    },

    {
        "question": "من يملك دفتر الموت في ديث نوت؟",
        "answers": ["لايت"]
    },

    {
    "question": "ما اسم عين مادارا بعد حصوله على خلايا هاشيراما؟",
    "answers": ["الرينيغان", "رينيغان"]
    },
    {
    "question": "من أول شخص استخدم تسوكويومي اللانهائية؟",
    "answers": ["كاغويا", "كاغويا اوتسوتسوكي"]
    },
    {
    "question": "من هو الشخص الذي زرع الرينغان في ناغاتو؟",
    "answers": ["مادارا", "مادارا اوتشيها"]
    },
    {
    "question": "ما اسم أخ ساسكي؟",
    "answers": ["ايتاتشي", "إيتاتشي"]
    },
    {
    "question": "من قتل دانزو؟",
    "answers": ["ساسكي"]
    },
    {
    "question": "ما اسم والد ساسكي؟",
    "answers": ["فوجاكو", "فوجاكو اوتشيها"]
    },
    
    {
    "question": "كم ذيل يمتلك الشوكاكو؟",
    "answers": ["1", "واحد"]
    },
    {
    "question": "من هو الجينشوريكي ذو الثمانية؟",
    "answers": ["كيلر بي", "بي"]
    },
    {
    "question": "ما اسم سيف كيسامي؟",
    "answers": ["ساميهادا"]
    },
    {
    "question": "ما اسم فاكهة لوفي الحقيقية؟",
    "answers": ["هيتو هيتو نومي", "نيكا", "هيتو هيتو نومي موديل نيكا"]
    },
    {
    "question": "من هو أول يونكو ظهر في الأنمي؟",
    "answers": ["شانكس"]
    },
    {
    "question": "من قتل اللحية البيضاء؟",
    "answers": ["اللحية السوداء", "تيتش"]
    },
    {
    "question": "من هو والد ايس الحقيقي؟",
    "answers": ["غول دي روجر", "روجر"]
    },
    {
    "question": "ما اسم سجن الحكومة العالمية؟",
    "answers": ["امبل داون", "إمبل داون"]
    },
    {
    "question": "من أنقذ لوفي في لوغ تاون؟",
    "answers": ["دراغون", "مونكي دي دراغون"]
    },
    {
    "question": "من هو قائد الجيش الثوري؟",
    "answers": ["دراغون", "مونكي دي دراغون"]
    },
    {
    "question": "من هو صاحب فاكهة الظلام؟",
    "answers": ["اللحية السوداء", "تيتش", "مارشال دي تيتش"]
    },
    {
    "question": "من يمتلك فاكهة الأوبي أوبي؟",
    "answers": ["ترافلغار لو", "لو"]
    },
    {
    "question": "من هو أخ لوفي بالتبني الثالث؟",
    "answers": ["سابو"]
    },
    {
    "question": "من هو هاشيرا الماء؟",
    "answers": ["غيو", "غيو توميوكا"]
    },
    {
    "question": "من هو هاشيرا اللهب؟",
    "answers": ["رينغوكو", "كيوجورو رينغوكو"]
    },
    {
    "question": "من قتل رينغوكو؟",
    "answers": ["اكازا"]
    },
    {
    "question": "من هو القمر العلوي الأول؟",
    "answers": ["كوكوشيبو"]
    },
    
    {
    "question": "من هو صاحب تقنية اللانهائية؟",
    "answers": ["غوجو", "ساتورو غوجو"]
    },
    {
    "question": "من قتل غوجو؟",
    "answers": ["سوكونا", "سكونا"]
    },
    {
    "question": "من هو معلم يوتا؟",
    "answers": ["غوجو"]
    },
        
    {
    "question": "من قتل نيتيرو؟",
    "answers": ["ميرويم"]
    },
    {
    "question": "من هو ملك النمل؟",
    "answers": ["ميرويم"]
    },
    {
    "question": "من هو والد كيلوا؟",
    "answers": ["سيلفا", "سيلفا زولديك"]
    },
    {
    "question": "من هو جد كيلوا؟",
    "answers": ["زينو", "زينو زولديك"]
    },
    {
    "question": "ما اسم أخ كيلوا الأكبر؟",
    "answers": ["ايلومي", "إيلومي"]
    },
    {
    "question": "من هو الشينيغامي الذي أحب ميسا؟",
    "answers": ["ريم"]
    },
    
    {
    "question": "من هو خليفة L الأول؟",
    "answers": ["نير", "Near"]
    },
    {
    "question": "من هو خليفة L الثاني؟",
    "answers": ["ميلو", "Mello"]
    },
    {
    "question": "من هو صاحب العملاق المدرع؟",
    "answers": ["راينر", "راينر براون"]
    },
    {
    "question": "من هو صاحب العملاق الضخم؟",
    "answers": ["بيرتولت", "بيرتهولد"]
    },
    {
    "question": "من هو صاحب العملاق الأنثى؟",
    "answers": ["آني", "اني ليونهارت"]
    },
    {
    "question": "من هو والد إيرين؟",
    "answers": ["غريشا", "غريشا ييغر"]
    },
    {
    "question": "من قتل ساشا؟",
    "answers": ["غابي"]
    },
    {
    "question": "من هو قائد فرقة الاستطلاع بعد موت إيروين؟",
    "answers": ["هانجي", "هانجي زوي"]
    },

    {
    "question": "من هو الشخص الذي هزم هيسوكا في برج السماء؟",
    "answers": ["كرولو", "كرولو لوسيلفر"]
    },
    
    {
    "question": "من هو هاشيرا تنفس الضباب؟",
    "answers": ["مويتشيرو", "مويتشيرو توكيتو"]
    },
    {
    "question": "من هو هاشيرا تنفس الصوت؟",
    "answers": ["تينغين", "تينغين اوزوي"]
    },
    {
    "question": "ما اسم الجزيرة التي حدثت فيها حرب المارينفورد؟",
    "answers": ["مارينفورد"]
    },
    {
    "question": "من هو الشخص الذي درّب لوفي على الهاكي؟",
    "answers": ["رايلي", "سيلفرز رايلي"]
    },
    {
    "question": "ما اسم والدة نامي بالتبني؟",
    "answers": ["بيلمير", "بيلمر"]
    },
    {
    "question": "من هو خصم زورو في أرك أراباستا؟",
    "answers": ["مستر ون", "داز بونز"]
    },
    
    {
    "question": "من هو صاحب فاكهةالرمل في ونبيس؟",
    "answers": ["كروكودايل"]
    },
    {
    "question": "ما اسم الجزيرة التي ظهر فيها كايدو لأول مرة؟",
    "answers": ["وانو"]
    },
    {
    "question": "من هو قائد قراصنة الوحوش؟",
    "answers": ["كايدو"]
    },
    
    {
    "question": "من هو الشخص الذي أعطى لوفي قبعة القش؟",
    "answers": ["شانكس"]
    },
    {
    "question": "ما اسم الجزيرة التي يعيش فيها العمالقة؟",
    "answers": ["إلباف", "الباف"]
    },
    {
    "question": "من هو أول خصم كبير واجهه لوفي في الجراند لاين؟",
    "answers": ["كروكودايل"]
    },
   
    {
    "question": "من هو صاحب فاكهة النار قبل سابو؟",
    "answers": ["ايس", "آيس"]
    },
    {
    "question": "ما اسم المنظمة التي ينتمي إليها دراغون؟",
    "answers": ["الجيش الثوري"]
    },
                
    {
        "question": "من هو صاحب فاكهة الضوء في ونبيس؟",
        "answers": ["كيزارو", "بورسالينو"]
    }
]


def get_random_anime_question():
    return random.choice(anime_questions)