import random


anime_questions = [

    {
    "question": "من هو بطل أنمي ناروتو؟",
    "answers": ["ناروتو"]
},
{
    "question": "ما اسم قرية ناروتو؟",
    "answers": ["كونوها", "قرية الورق"]
},
{
    "question": "من هو والد ناروتو؟",
    "answers": ["ميناتو", "ميناتو ناميكازي"]
},
{
    "question": "من هي والدة ناروتو؟",
    "answers": ["كوشينا", "كوشينا اوزوماكي"]
},
{
    "question": "من هو معلم الفريق السابع؟",
    "answers": ["كاكاشي", "كاكاشي هاتاكي"]
},
{
    "question": "من هو منافس ناروتو؟",
    "answers": ["ساسكي", "ساسكي اوتشيها"]
},
{
    "question": "من هي زميلة ناروتو في الفريق السابع؟",
    "answers": ["ساكورا", "ساكورا هارونو"]
},
{
    "question": "ما اسم الوحش المختوم داخل ناروتو؟",
    "answers": ["الكيوبي", "ذو الذيول التسعة", "كوراما"]
},
{
    "question": "كم عدد الذيول التي يمتلكها كوراما؟",
    "answers": ["9", "تسعة"]
},
{
    "question": "من هو الهوكاجي الرابع؟",
    "answers": ["ميناتو", "ميناتو ناميكازي"]
},
{
    "question": "من هو بطل ون بيس؟",
    "answers": ["لوفي", "مونكي دي لوفي"]
},
{
    "question": "ما اسم قبعة لوفي؟",
    "answers": ["قبعة القش"]
},
{
    "question": "من هو سياف طاقم قبعة القش؟",
    "answers": ["زورو", "رورونوا زورو"]
},
{
    "question": "من هو الطباخ في الطاقم؟",
    "answers": ["سانجي"]
},
{
    "question": "من هي الملاحة؟",
    "answers": ["نامي"]
},
{
    "question": "من هو الطبيب؟",
    "answers": ["تشوبر", "توني توني تشوبر"]
},
{
    "question": "من هو القناص؟",
    "answers": ["اوسوب", "يوسوب"]
},
{
    "question": "من هي عالمة الآثار؟",
    "answers": ["نيكو روبين", "روبين"]
},
{
    "question": "من هو الموسيقي؟",
    "answers": ["بروك"]
},
{
    "question": "من هو قائد الثوار؟",
    "answers": ["دراغون", "مونكي دي دراغون"]
},
{
    "question": "من هو ملك القراصنة السابق؟",
    "answers": ["غول دي روجر", "روجر"]
},
{
    "question": "من هو نائب ملك القراصنة؟",
    "answers": ["رايلي", "سيلفرز رايلي"]
},
{
    "question": "من هو أقوى سياف في العالم؟",
    "answers": ["ميهوك", "دراكيول ميهوك"]
},
{
    "question": "من هو قائد قراصنة اللحية البيضاء؟",
    "answers": ["اللحية البيضاء", "ادوارد نيوغيت"]
},
{
    "question": "من قتل ايس؟",
    "answers": ["اكاينو", "ساكازوكي"]
},
{
    "question": "من هو بطل ديمون سلاير؟",
    "answers": ["تانجيرو", "تانجيرو كامادو"]
},
{
    "question": "من هي أخت تانجيرو؟",
    "answers": ["نيزوكو"]
},
{
    "question": "من هو أقوى هاشيرا حسب أغلب الأحداث؟",
    "answers": ["غيومي", "غيومي هيميجيما"]
},
{
    "question": "من هو زعيم الشياطين؟",
    "answers": ["موزان", "موزان كيبوتسوجي"]
},
{
    "question": "من هو بطل جوجوتسو كايسن؟",
    "answers": ["ايتادوري", "يوجي", "يوجي ايتادوري"]
},
    {
    "question": "من هو أقوى ساحر؟",
    "answers": ["غوجو", "ساتورو غوجو"]
    },
    {
    "question": "من هو ملك اللعنات؟",
    "answers": ["سكونا", "ريومن سكونا"]
    },
    {
    "question": "من هو صديق يوجي المقرب؟",
    "answers": ["ميغومي", "فوشيغورو"]
    },
    
    {
    "question": "من هو بطل هنتر × هنتر؟",
    "answers": ["غون", "غون فريكس"]
    },
    {
    "question": "من هو أفضل صديق لغون؟",
    "answers": ["كيلوا", "كيلوا زولديك"]
    },
    {
    "question": "من هو زعيم العناكب؟",
    "answers": ["كرولو", "كرولو لوسيلفر"]
    },
    {
    "question": "من يستخدم سلاسل النين؟",
    "answers": ["كورابيكا"]
    },
    {
    "question": "من هو والد غون؟",
    "answers": ["جين", "جين فريكس"]
    },
    {
    "question": "من هو بطل ديث نوت؟",
    "answers": ["لايت", "لايت ياغامي"]
    },
    {
    "question": "ما اسم الشينيغامي الذي أعطى لايت الدفتر؟",
    "answers": ["ريوك"]
    },
    {
    "question": "من هو المحقق الشهير في ديث نوت؟",
    "answers": ["ال", "L"]
    },
    {
    "question": "من هو بطل هجوم العمالقة؟",
    "answers": ["ايرين", "ايرين ييغر"]
    },
    {
    "question": "من هي أخت إيرين بالتبني؟",
    "answers": ["ميكاسا"]
    },
    {
    "question": "من هو صديق إيرين؟",
    "answers": ["ارمين"]
    },
    {
    "question": "من هو بطل دراغون بول؟",
    "answers": ["غوكو", "سون غوكو"]
    },
    {
    "question": "من هو أمير الساياجين؟",
    "answers": ["فيجيتا"]
    },
    {
    "question": "من هو أقوى أندرويد في دراغون بول سوبر؟",
    "answers": ["17", "اندرويد 17"]
    },
    {
    "question": "ما اسم التحول الأخير لغوكو؟",
    "answers": ["التلقائية الفائقة", "ألترا إنستنكت", "ultra instinct"]
    },
    {
    "question": "من هو والد غوهان؟",
    "answers": ["غوكو", "سون غوكو"]
    }

    {
        "question": "من هو قائد منظمة الأكاتسوكي؟",
        "answers": ["باين", "ناغاتو"]
    },

    {
        "question": "من هو بطل أنمي ون بيس؟",
        "answers": ["لوفي"]
    },
    
    {
        "question": "من هو أقوى مشعوذ في جوجوتسو كايسن؟",
        "answers": ["غوجو"]
    },

    {
        "question": "من هو بطل انمي قاتل الشياطين؟",
        "answers": ["تانجيرو"]
    },

    {
        "question": "من يملك دفتر الموت في ديث نوت؟",
        "answers": ["لايت"]
    },

]


def get_random_anime_question():
    return random.choice(anime_questions)